import numpy as np

w = np.array([2.0, 3.0, -1.0])
x = np.array([1.0, 4.0, 5.0])

print(w @ x) #скаляр векторов

X = np.array([
    [1, 2],
    [3, 4],
    [5, 6]
])

w = np.array([10, 0.5])

print(X @ w)

A = np.array([
    [1, 2, 3],
    [4, 5, 6]
])

B = np.array([
    [10, 20],
    [30, 40],
    [50, 60]
])

# Умножаем (2, 3) на (3, 2) -> получаем (2, 2)
C = A @ B

print(C.shape)
print(C)
# Выведет:
# [[220  280]
#  [490  640]]
# Считаем ячейку [0,0]: 1*10 + 2*30 + 3*50 = 10 + 60 + 150 = 220